Revit 2026 API

# ImagePlacementOptions Class

---

ImagePlacementOptions are used to describe where an ImageInstance should be placed in a view

SystemObject Autodesk.Revit.DBImagePlacementOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ImagePlacementOptions : IDisposable
```
```vb
Public Class ImagePlacementOptions
	Implements IDisposable
```
```cpp
public ref class ImagePlacementOptions : IDisposable
```
```fsharp
type ImagePlacementOptions =
    class
        interface IDisposable
    end
```

The ImagePlacementOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ImagePlacementOptions | Constructs a new ImagePlacementOptions that will place an ImageInstance with its center at the origin of the model |
|  | ImagePlacementOptions(XYZ, BoxPlacement) | Constructs a new ImagePlacementOptions for placing an ImageInstance |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Location | The location in the model where a point of the ImageInstance, determined by the PlacementPoint property, is going to be inserted. |
|  | PlacementPoint | Identifies which point of the ImageInstance will be aligned to the Location |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ImagePlacementOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace